<?php
$data = [
<<<<<<< HEAD
    '山田太郎'   => ['男',     '1982-08-23', '北海道旭川市'],
    '横山花子'   => ['女',     '1998-02-12', '岩手県遠野市'],
    '田中一郎'   => ['男',     '1972-12-24', '神奈川県逗子市'],
    '山本久美子' => ['女',     '1983-04-20', '愛知県刈谷市'],
    '鈴木次郎'   => ['男',     '1990-03-09', '滋賀県大津市'],
    '星山裕子'   => ['その他', '1987-11-15', '岡山県倉敷市'],
    '佐藤勝男'   => ['男',     '1995-07-07', '山口県萩市'],
];
?>
名簿には<?=count($data) ?>人が登録されています。
<dl>
<?php
    foreach ($data as $name => $prof) {
        $pos = mb_strpos($name, $_POST['keywd']);
        if ($pos !== FALSE) {
            if ($prof[0] === '男') {
                $img = '../images/male.gif';
            } else if ($prof[0] === '女') {
                $img = '../images/female.gif';
            } else {
                $img = '../images/other.gif';
            }
?>
			<dt><img src="<?=$img ?>" alt="<?=$prof[0] ?>" /></dt>
        	<dt><?=$name ?></dt>
        	<dd>性別:<?=$prof[0] ?></dd>
        	<dd>生年月日:<?=$prof[1] ?></dd>
        	<dd>住所:<?=$prof[2] ?></dd>
<?php
        }
    }
=======
    '山田太郎'   => ['男',    '1988-11-18', '北海道函館市'], 
    '横山花子'   => ['女',    '1993-05-23', '岩手県遠野市'], 
    '田中一郎'   => ['男',    '1965-07-13', '山口県萩市'], 
    '山本久美子' => ['女',    '1997-09-03', '千葉県我孫子市'], 
    '鈴木次郎'   => ['男',    '1986-03-19', '愛知県豊田市'], 
    '星山裕子'   => ['その他', '1998-01-10', '大阪府岸和田市'], 
    '佐藤勝男'   => ['男',     '1979-09-30', '東京都西東京市']
];
?>
<p>名簿には<?=count($data); ?>人が登録されています。</p>
<dl>
<?php 
foreach($data as $name => $prof) { 
    $pos = mb_strpos($name, $_POST['keywd']);
    if ($pos !== FALSE) {    
?>
        <dt><?=$name ?></dt>
        <dd>性別: <?=$prof[0] ?></dd>
        <dd>生年月日: <?=$prof[1] ?></dd>
        <dd>住所: <?=$prof[2] ?></dd>
<?php 
    } 
}    
>>>>>>> ffa46c1c36d5915004c60d3447b66617e20ac4f8
?>
</dl>